# Working with CSV, JSON & SQL

In this file we will going to see Basic Script of load dataset and some parameter of "pd.read_csv"  file
and also Basic Script of working on SQL & JSON files

# 1 . Load Dataset

In [35]:
import pandas as pd

In [36]:
data = pd.read_csv("C:\\Users\\AdityaRaj Sharma\\Python Data sets\\50_Startups.csv")
data.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

# 2.  sep parameter

IT  seperate through tab

In [31]:
data_2 = pd.read_csv("C:\\Users\\AdityaRaj Sharma\\Python Data sets\\50_Startups.csv",sep = '\t')
data_2.head()

  R&D Spend,Administration,Marketing Spend,State,Profit
0      165349.2,136897.8,471784.1,New York,192261.83
1  162597.7,151377.59,443898.53,California,191792.06
2    153441.51,101145.55,407934.54,Florida,191050.39
3   144372.41,118671.85,383199.62,New York,182901.99
4     142107.34,91391.77,366168.42,Florida,166187.94

# 2.1 If i want to pass the name of heading by my choice i can do that using "names parameter" eg below

In [25]:
# data = pd.read_csv("C:\\Users\\AdityaRaj Sharma\\Python Data sets\\50_Startups.csv", names = ["write the name which you want to give"])
# data.head()

# 3. header parameter

when you want to provide the row name as column name use this

In [40]:
data_3 = pd.read_csv("C:\\Users\\AdityaRaj Sharma\\Python Data sets\\50_Startups.csv", header = 1)
data_3.head()

    165349.2   136897.8   471784.1    New York  192261.83
0  162597.70  151377.59  443898.53  California  191792.06
1  153441.51  101145.55  407934.54     Florida  191050.39
2  144372.41  118671.85  383199.62    New York  182901.99
3  142107.34   91391.77  366168.42     Florida  166187.94
4  131876.90   99814.71  362861.36    New York  156991.12

# 4. use_cols parameter

while load data set provide the name of columns you need instead of loading whole dataset

In [41]:
# pd.read_csv(" pass the address of data set.csv",usecols=['pass the column name'])

# 5. Squeeze parameter

convert dataframe to series

pd.read_csv(" pass the address of data set.csv",usecols=['pass the column name'], squeeze = True)

# 6. Woking with Json

# for json -  

data = pd.read_json ("file name")

# 7. Working with SQL

! pip install mysql.connector

import mysql.connector

mysql.connector.connect(host = 'localhost',user='root', password =' ', database = 'world')

pd.read_sql_query("write Query")